{
  "experience": [
    {
      "title": "AI Software Engineer",
      "company": "Dayforce",
      "duration": "September 2025 – Present",
      "techStack": [
        "LangGraph",
        "Python",
        "ChromaDB",
        "FastAPI",
        "Playwright",
        "MCP",
        "SQL"
      ],
      "highlights": [
        "Built QueryGPT, an internal agentic application, leveraging LangChain, RAG, and ChromaDB to support natural-language SQL generation across 50K+ tables.",
        "Developed a Playwright MCP agent that translates natural-language instructions into automated browser workflows, allowing teams to validate client configuration logic without manual test scripting.",
        "Implemented server-side request validation using Pydantic models in FastAPI, enforcing strict schema checks and preventing malformed or malicious payloads from reaching internal services."
      ]
    },
    {
      "title": "Software Engineer — Code Review Go",
      "company": "Mercor",
      "duration": "August 2025 – September 2025",
      "techStack": ["Go", "Airtable"],
      "highlights": [
        "Completed Code Reviews for Github CLI (Golang) and Airtable API (Go)"
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Learning Mode AI",
      "duration": "May 2025 – August 2025",
      "techStack": ["Go", "Redis", "JavaScript", "OpenAI Assistants API"],
      "highlights": [
        "Implemented a quiz service in a microservices-based architecture using Go and Redis, allowing for easy scalability and maintenance.",
        "Built a time-synced quiz overlay that dynamically tracks video position and updates questions in real-time, enhancing learning interactivity.",
        "Integrated OpenAI Assistants API to generate questions based on video context, improving content adaptability."
      ]
    },
    {
      "title": "Software Developer",
      "company": "Magnet Forensics",
      "duration": "January 2025 – April 2025",
      "techStack": ["C#", ".NET", "AzureDevops", "Jenkins"],
      "highlights": [
        "Developed Fastrak using C# (.NET stack) to offload data acquisition from GrayKey to standard PCs, reducing GrayKey usage per phone by 85%.",
        "Enabled simultaneous extractions, significantly improving the efficiency of a $60k tool."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Annaly",
      "duration": "February 2024 – August 2024",
      "techStack": [
        "C#",
        ".NET",
        "VCron",
        "SQL Server",
        "Mailgun API",
        "Azure"
      ],
      "highlights": [
        "Designed and implemented an ETL Notifier System using C#, .NET, VCron, and SQL Server, reducing incident response time by 95%.",
        "Migrated 24 margin calculation applications from Microsoft Interop to ClosedXML, cutting execution time by 50% and reducing server CPU usage by 40%.",
        "Built an email logging system using Mailgun API and SQL Server, reducing audit lookup time by 75%."
      ]
    },
    {
      "title": "Data Analyst",
      "company": "Enbridge",
      "duration": "June 2023 – September 2023",
      "techStack": ["SAP Hana", "Excel", "Microsoft Power Apps"],
      "highlights": [
        "Developed an internal tool using Microsoft Power Apps, resulting in a 75% increase in inter-departmental communication efficiency."
      ]
    },
    {
      "title": "Software Developer",
      "company": "Koho Financial",
      "duration": "May 2022 – May 2023",
      "techStack": ["Angular", "Go", "Jenkins", "NgRx"],
      "highlights": [
        "Engineered integration tests using Go, integrating with Jenkins pipeline and reducing QA time by 45%.",
        "Integrated Google Pay API into Koho’s mobile app, driving 40% adoption among Android users and processing $2M in transactions within the first quarter.",
        "Implemented NgRx state management across mobile app, reducing API calls by 60% and cutting load times by 30%."
      ]
    },
    {
      "title": "Teaching Assistant",
      "company": "University of Toronto",
      "duration": "January 2022 – May 2025",
      "techStack": ["Python"],
      "highlights": [
        "Instructed over 2,000 students across 6 semesters in data structures, algorithms, OOP, and complexity using Python in an active learning environment.",
        "Led weekly labs for 5 sections, improving average grades by 47% by creating lesson outlines and aiding students."
      ]
    }
  ]
}
